app/controllers/settings/companies_controller.rb

UPDATE "companies" SET "website" = 'www.cadeisdabomb.com', "updated_at" = '2011-09-02 04:40:31.537295' WHERE "companies"."id" = 1
---
  def update
    if @company.update_attributes(params[:company])