app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("company_id", "created_at", "email", "password_hash", "password_salt", "role_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)